def cyrillic_to_latin(text):
    transliteration_table = {
        "а": "a", "б": "b", "в": "v", "г": "g", "д": "d",
        "е": "e", "ё": "yo", "ж": "zh", "з": "z", "и": "i",
        "й": "y", "к": "k", "л": "l", "м": "m", "н": "n",
        "о": "o", "п": "p", "р": "r", "с": "s", "т": "t",
        "у": "u", "ф": "f", "х": "kh", "ц": "ts", "ч": "ch",
        "ш": "sh", "щ": "shch", "ъ": "", "ы": "y", "ь": "",
        "э": "e", "ю": "yu", "я": "ya", "қ": "k", "ұ": "u",
        "ү": "u", "ғ": "g", "ң": "n", "і": "i", "ә": "a",
        "ө": "o", "һ": "h",
        "А": "A", "Б": "B", "В": "V", "Г": "G", "Д": "D",
        "Е": "E", "Ё": "Yo", "Ж": "Zh", "З": "Z", "И": "I",
        "Й": "Y", "К": "K", "Л": "L", "М": "M", "Н": "N",
        "О": "O", "П": "P", "Р": "R", "С": "S", "Т": "T",
        "У": "U", "Ф": "F", "Х": "Kh", "Ц": "Ts", "Ч": "Ch",
        "Ш": "Sh", "Щ": "Shch", "Ъ": "", "Ы": "Y", "Ь": "",
        "Э": "E", "Ю": "Yu", "Я": "Ya", "Қ": "K", "Ұ": "U",
        "Ү": "U", "Ғ": "G", "Ң": "N", "І": "I", "Ә": "A", 
        "Ө": "O", "Һ": "H",
    }

    result = ''.join(transliteration_table.get(char, char) for char in text)
    return result

# text_cyrillic = "Привет, как дела?"
# text_latin = cyrillic_to_latin(text_cyrillic)
# print(text_latin)  # Вывод: Privet, kak dela?
# Қ қ Ұ ұ Ү ү Ғ ғ Ң ң І і Ә ә 